In [1]:
import pandas as pd
import numpy as np

In [20]:
alameda12 = pd.read_csv('./alameda_parcels_12in.csv')
alameda24 = pd.read_csv('./alameda_parcels_24in.csv')
alameda36 = pd.read_csv('./alameda_parcels_36in.csv')
alameda48 = pd.read_csv('./alameda_parcels_48in.csv')
alameda52 = pd.read_csv('./alameda_parcels_52in.csv')
alameda66 = pd.read_csv('./alameda_parcels_66in.csv')
alameda77 = pd.read_csv('./alameda_parcels_77in.csv')
contracosta12 = pd.read_csv('./contracosta_parcels_12in.csv')
contracosta24 = pd.read_csv('./contracosta_parcels_24in.csv')
contracosta36 = pd.read_csv('./contracosta_parcels_36in.csv')
contracosta48 = pd.read_csv('./contracosta_parcels_48in_updated.csv')
contracosta52 = pd.read_csv('./contracosta_parcels_52in.csv')
contracosta66 = pd.read_csv('./contracosta_parcels_66in.csv')
contracosta77 = pd.read_csv('./contracosta_parcels_77in.csv')
marin12 = pd.read_csv('./marin_parcels_12in.csv')
marin24 = pd.read_csv('./marin_parcels_24in.csv')
marin36 = pd.read_csv('./marin_parcels_36in.csv')
marin48 = pd.read_csv('./marin_parcels_48in.csv')
marin52 = pd.read_csv('./marin_parcels_52in.csv')
marin66 = pd.read_csv('./marin_parcels_66in.csv')
marin77 = pd.read_csv('./marin_parcels_77in.csv')
napa12 = pd.read_csv('./napa_parcels_12in.csv')
napa24 = pd.read_csv('./napa_parcels_24in.csv')
napa36 = pd.read_csv('./napa_parcels_36in.csv')
napa48 = pd.read_csv('./napa_parcels_48in.csv')
napa52 = pd.read_csv('./napa_parcels_52in.csv')
napa66 = pd.read_csv('./napa_parcels_66in.csv')
napa77 = pd.read_csv('./napa_parcels_77in.csv')
sanfrancisco12 = pd.read_csv('./sanfrancisco_parcels_12in.csv')
sanfrancisco24 = pd.read_csv('./sanfrancisco_parcels_24in.csv')
sanfrancisco36 = pd.read_csv('./sanfrancisco_parcels_36in.csv')
sanfrancisco48 = pd.read_csv('./sanfrancisco_parcels_48in.csv')
sanfrancisco52 = pd.read_csv('./sanfrancisco_parcels_52in.csv')
sanfrancisco66 = pd.read_csv('./sanfrancisco_parcels_66in.csv')
sanfrancisco77 = pd.read_csv('./sanfrancisco_parcels_77in.csv')
santaclara12 = pd.read_csv('./santaclara_parcels_12in.csv')
santaclara24 = pd.read_csv('./santaclara_parcels_24in.csv')
santaclara36 = pd.read_csv('./santaclara_parcels_36in.csv')
santaclara48 = pd.read_csv('./santaclara_parcels_48in.csv')
santaclara52 = pd.read_csv('./santaclara_parcels_52in.csv')
santaclara66 = pd.read_csv('./santaclara_parcels_66in.csv')
santaclara77 = pd.read_csv('./santaclara_parcels_77in.csv')
sanmateo12 = pd.read_csv('./sanmateo_parcels_12in.csv')
sanmateo24 = pd.read_csv('./sanmateo_parcels_24in.csv')
sanmateo36 = pd.read_csv('./sanmateo_parcels_36in.csv')
sanmateo48 = pd.read_csv('./sanmateo_parcels_48in.csv')
sanmateo52 = pd.read_csv('./sanmateo_parcels_52in.csv')
sanmateo66 = pd.read_csv('./sanmateo_parcels_66in.csv')
sanmateo77 = pd.read_csv('./sanmateo_parcels_77in.csv')
solano12 = pd.read_csv('./solano_parcels_12in.csv')
solano24 = pd.read_csv('./solano_parcels_24in.csv')
solano36 = pd.read_csv('./solano_parcels_36in.csv')
solano48 = pd.read_csv('./solano_parcels_48in.csv')
solano52 = pd.read_csv('./solano_parcels_52in.csv')
solano66 = pd.read_csv('./solano_parcels_66in.csv')
solano77 = pd.read_csv('./solano_parcels_77in.csv')
sonoma12 = pd.read_csv('./sonoma_parcels_12in.csv')
sonoma24 = pd.read_csv('./sonoma_parcels_24in.csv')
sonoma36 = pd.read_csv('./sonoma_parcels_36in.csv')
sonoma48 = pd.read_csv('./sonoma_parcels_48in.csv')
sonoma52 = pd.read_csv('./sonoma_parcels_52in.csv')
sonoma66 = pd.read_csv('./sonoma_parcels_66in.csv')
sonoma77 = pd.read_csv('./sonoma_parcels_77in.csv')

In [21]:
sanmateo52.head()

,OBJECTID,VALUE,COUNT,AREA,MIN,MAX,RANGE,MEAN,STD,SUM
0,-1,1236492,1755,1755.0,0.012967,8.721968,8.709000,5.144787,2.370428,9029.100856
1,-1,1050735,551,551.0,4.284108,8.265827,3.981719,6.455478,0.905310,3556.968310
2,-1,1050733,397,397.0,0.035857,5.399268,5.363412,2.669504,1.388759,1059.793185
3,-1,1050734,6196,6196.0,0.000237,3.053199,3.052962,1.278724,0.768618,7922.973958
4,-1,1056396,11799,11799.0,0.189483,13.352617,13.163135,7.907118,3.132706,93296.085119

In [22]:
sanfrancisco52.head()

,OBJECTID,VALUE,COUNT,AREA,MIN,MAX,RANGE,MEAN,STD,SUM
0,-1,914191,164994,164994.0,0.000048,29.484625,29.484577,3.079706,2.617321,508133.015569
1,-1,895343,2677,2677.0,0.004489,41.378578,41.374089,11.706519,13.229655,31338.352340
2,-1,1042043,38,38.0,30.331261,45.966751,15.635490,37.146034,5.136307,1411.549301
3,-1,1042039,1186,1186.0,0.022905,32.814899,32.791994,16.296595,10.276379,19327.762206
4,-1,1042035,26,26.0,7.156784,41.044033,33.887249,32.948181,6.740205,856.652694

In [23]:
sonoma52.head()

,OBJECTID,VALUE,COUNT,AREA,MIN,MAX,RANGE,MEAN,STD,SUM
0,-1,1992520,2699,2699.0,0.000680,3.892607,3.891927,0.619272,0.530314,1671.416119
1,-1,1992513,27756,27756.0,0.000041,5.759591,5.759550,1.245193,1.185427,34561.577784
2,-1,1998155,68,68.0,0.002488,0.532107,0.529619,0.232451,0.161837,15.806702
3,-1,1992518,706,706.0,0.002866,4.062714,4.059848,1.665706,1.639813,1175.988751
4,-1,1992519,124,124.0,0.012453,3.894466,3.882013,1.766352,1.324562,219.027681

In [24]:
alameda12['slr12'] = 12
alameda12 = alameda12[['Value','slr12']]
alameda24['slr24'] = 24
alameda24 = alameda24[['Value','slr24']]
alameda36['slr36'] = 36
alameda36 = alameda36[['Value','slr36']]
alameda48['slr48'] = 48
alameda48 = alameda48[['Value','slr48']]
alameda52['slr52'] = 52
alameda52 = alameda52[['Value','slr52']]
alameda66['slr66'] = 66
alameda66 = alameda66[['Value','slr66']]
alameda77['slr77'] = 77
alameda77 = alameda77[['Value','slr77']]

In [25]:
alameda = alameda77.merge(alameda66, how='left', on='Value')
alameda = alameda.merge(alameda52, how='left', on='Value')
alameda = alameda.merge(alameda48, how='left', on='Value')
alameda = alameda.merge(alameda36, how='left', on='Value')
alameda = alameda.merge(alameda24, how='left', on='Value')
alameda = alameda.merge(alameda12, how='left', on='Value')

In [26]:
# alameda.shape

In [27]:
# 77- when SLR is 7 feet this parcel will be covered-- it will be reached by SLR
# 12- when SLR is 1 foot this parcel will be covered -- it will be reached by SLR

In [28]:
alameda['slr'] = 12
alameda = alameda.fillna(0)

In [29]:
for i in alameda.index:
    if alameda['slr66'].loc[i] == 0:
        alameda.loc[i, 'slr'] = 77
    elif alameda['slr52'].loc[i] == 0:
        alameda.loc[i, 'slr'] = 66
    elif alameda['slr48'].loc[i] == 0:
        alameda.loc[i, 'slr'] = 52
    elif alameda['slr36'].loc[i] == 0:
        alameda.loc[i, 'slr'] = 48
    elif alameda['slr24'].loc[i] == 0:
        alameda.loc[i, 'slr'] = 36
    elif alameda['slr12'].loc[i] == 0:
        alameda.loc[i, 'slr'] = 24

In [30]:
alameda.head()

   Value  slr77  slr66  slr52  slr48  slr36  slr24  slr12  slr
0      1     77   66.0   52.0   48.0   36.0   24.0   12.0   12
1      2     77   66.0   52.0   48.0   36.0   24.0   12.0   12
2      3     77   66.0   52.0   48.0   36.0   24.0   12.0   12
3      4     77   66.0   52.0    0.0    0.0    0.0    0.0   52
4      5     77   66.0   52.0    0.0    0.0    0.0    0.0   52

In [31]:
alameda.shape

(27383, 9)

In [32]:
contracosta12['slr12'] = 12
contracosta12 = contracosta12[['VALUE','slr12']]
contracosta24['slr24'] = 24
contracosta24 = contracosta24[['VALUE','slr24']]
contracosta36['slr36'] = 36
contracosta36 = contracosta36[['VALUE','slr36']]
contracosta48['slr48'] = 48
contracosta48 = contracosta48[['VALUE','slr48']]
contracosta52['slr52'] = 52
contracosta52 = contracosta52[['VALUE','slr52']]
contracosta66['slr66'] = 66
contracosta66 = contracosta66[['VALUE','slr66']]
contracosta77['slr77'] = 77
contracosta77 = contracosta77[['VALUE','slr77']]

In [33]:
contracosta = contracosta77.merge(contracosta66, how='left', on='VALUE')
contracosta = contracosta.merge(contracosta52, how='left', on='VALUE')
contracosta = contracosta.merge(contracosta48, how='left', on='VALUE')
contracosta = contracosta.merge(contracosta36, how='left', on='VALUE')
contracosta = contracosta.merge(contracosta24, how='left', on='VALUE')
contracosta = contracosta.merge(contracosta12, how='left', on='VALUE')

In [34]:
contracosta['slr'] = 12
contracosta = contracosta.fillna(0)

In [35]:
for i in contracosta.index:
    if contracosta['slr66'].loc[i] == 0:
        contracosta.loc[i, 'slr'] = 77
    elif contracosta['slr52'].loc[i] == 0:
        contracosta.loc[i, 'slr'] = 66
    elif contracosta['slr48'].loc[i] == 0:
        contracosta.loc[i, 'slr'] = 52
    elif contracosta['slr36'].loc[i] == 0:
        contracosta.loc[i, 'slr'] = 48
    elif contracosta['slr24'].loc[i] == 0:
        contracosta.loc[i, 'slr'] = 36
    elif contracosta['slr12'].loc[i] == 0:
        contracosta.loc[i, 'slr'] = 24

In [36]:
contracosta.head()

    VALUE  slr77  slr66  slr52  slr48  slr36  slr24  slr12  slr
0  670493     77   66.0   52.0   48.0   36.0   24.0   12.0   12
1  670412     77   66.0   52.0   48.0   36.0   24.0   12.0   12
2  670441     77   66.0   52.0   48.0   36.0   24.0   12.0   12
3  670442     77   66.0   52.0   48.0   36.0   24.0   12.0   12
4  670440     77   66.0   52.0   48.0   36.0   24.0   12.0   12

In [37]:
contracosta.shape

(2758, 9)

In [38]:
marin12['slr12'] = 12
marin12 = marin12[['VALUE','slr12']]
marin24['slr24'] = 24
marin24 = marin24[['VALUE','slr24']]
marin36['slr36'] = 36
marin36 = marin36[['VALUE','slr36']]
marin48['slr48'] = 48
marin48 = marin48[['VALUE','slr48']]
marin52['slr52'] = 52
marin52 = marin52[['VALUE','slr52']]
marin66['slr66'] = 66
marin66 = marin66[['VALUE','slr66']]
marin77['slr77'] = 77
marin77 = marin77[['VALUE','slr77']]

In [39]:
marin = marin77.merge(marin66, how='left', on='VALUE')
marin = marin.merge(marin52, how='left', on='VALUE')
marin = marin.merge(marin48, how='left', on='VALUE')
marin = marin.merge(marin36, how='left', on='VALUE')
marin = marin.merge(marin24, how='left', on='VALUE')
marin = marin.merge(marin12, how='left', on='VALUE')

In [40]:
marin['slr'] = 12
marin = marin.fillna(0)

In [41]:
for i in marin.index:
    if marin['slr66'].loc[i] == 0:
        marin.loc[i, 'slr'] = 77
    elif marin['slr52'].loc[i] == 0:
        marin.loc[i, 'slr'] = 66
    elif marin['slr48'].loc[i] == 0:
        marin.loc[i, 'slr'] = 52
    elif marin['slr36'].loc[i] == 0:
        marin.loc[i, 'slr'] = 48
    elif marin['slr24'].loc[i] == 0:
        marin.loc[i, 'slr'] = 36
    elif marin['slr12'].loc[i] == 0:
        marin.loc[i, 'slr'] = 24

In [42]:
marin.head()

    VALUE  slr77  slr66  slr52  slr48  slr36  slr24  slr12  slr
0  799508     77   66.0   52.0   48.0   36.0   24.0   12.0   12
1  799509     77   66.0   52.0   48.0   36.0   24.0   12.0   12
2  799512     77   66.0   52.0   48.0   36.0   24.0   12.0   12
3  799513     77   66.0   52.0   48.0   36.0   24.0   12.0   12
4  799558     77   66.0   52.0   48.0   36.0   24.0    0.0   24

In [43]:
marin.shape

(14463, 9)

In [44]:
napa12['slr12'] = 12
napa12 = napa12[['Value','slr12']]
napa24['slr24'] = 24
napa24 = napa24[['Value','slr24']]
napa36['slr36'] = 36
napa36 = napa36[['Value','slr36']]
napa48['slr48'] = 48
napa48 = napa48[['Value','slr48']]
napa52['slr52'] = 52
napa52 = napa52[['Value','slr52']]
napa66['slr66'] = 66
napa66 = napa66[['Value','slr66']]
napa77['slr77'] = 77
napa77 = napa77[['Value','slr77']]

In [45]:
napa = napa77.merge(napa66, how='left', on='Value')
napa = napa.merge(napa52, how='left', on='Value')
napa = napa.merge(napa48, how='left', on='Value')
napa = napa.merge(napa36, how='left', on='Value')
napa = napa.merge(napa24, how='left', on='Value')
napa = napa.merge(napa12, how='left', on='Value')

In [46]:
napa['slr'] = 12
napa = napa.fillna(0)

In [47]:
for i in napa.index:
    if napa['slr66'].loc[i] == 0:
        napa.loc[i, 'slr'] = 77
    elif napa['slr52'].loc[i] == 0:
        napa.loc[i, 'slr'] = 66
    elif napa['slr48'].loc[i] == 0:
        napa.loc[i, 'slr'] = 52
    elif napa['slr36'].loc[i] == 0:
        napa.loc[i, 'slr'] = 48
    elif napa['slr24'].loc[i] == 0:
        napa.loc[i, 'slr'] = 36
    elif napa['slr12'].loc[i] == 0:
        napa.loc[i, 'slr'] = 24

In [48]:
napa.head()

    Value  slr77  slr66  slr52  slr48  slr36  slr24  slr12  slr
0  842868     77    0.0    0.0    0.0    0.0    0.0    0.0   77
1  842870     77   66.0   52.0    0.0    0.0    0.0    0.0   52
2  842996     77   66.0   52.0   48.0   36.0    0.0    0.0   36
3  843003     77   66.0   52.0   48.0   36.0   24.0    0.0   24
4  843004     77   66.0   52.0   48.0   36.0   24.0    0.0   24

In [49]:
napa.shape

(872, 9)

In [50]:
sanfrancisco12['slr12'] = 12
sanfrancisco12 = sanfrancisco12[['VALUE','slr12']]
sanfrancisco24['slr24'] = 24
sanfrancisco24 = sanfrancisco24[['VALUE','slr24']]
sanfrancisco36['slr36'] = 36
sanfrancisco36 = sanfrancisco36[['VALUE','slr36']]
sanfrancisco48['slr48'] = 48
sanfrancisco48 = sanfrancisco48[['VALUE','slr48']]
sanfrancisco52['slr52'] = 52
sanfrancisco52 = sanfrancisco52[['VALUE','slr52']]
sanfrancisco66['slr66'] = 66
sanfrancisco66 = sanfrancisco66[['VALUE','slr66']]
sanfrancisco77['slr77'] = 77
sanfrancisco77 = sanfrancisco77[['VALUE','slr77']]

In [51]:
sanfrancisco = sanfrancisco77.merge(sanfrancisco66, how='left', on='VALUE')
sanfrancisco = sanfrancisco.merge(sanfrancisco52, how='left', on='VALUE')
sanfrancisco = sanfrancisco.merge(sanfrancisco48, how='left', on='VALUE')
sanfrancisco = sanfrancisco.merge(sanfrancisco36, how='left', on='VALUE')
sanfrancisco = sanfrancisco.merge(sanfrancisco24, how='left', on='VALUE')
sanfrancisco = sanfrancisco.merge(sanfrancisco12, how='left', on='VALUE')

In [52]:
sanfrancisco['slr'] = 12
sanfrancisco = sanfrancisco.fillna(0)

In [53]:
for i in sanfrancisco.index:
    if sanfrancisco['slr66'].loc[i] == 0:
        sanfrancisco.loc[i, 'slr'] = 77
    elif sanfrancisco['slr52'].loc[i] == 0:
        sanfrancisco.loc[i, 'slr'] = 66
    elif sanfrancisco['slr48'].loc[i] == 0:
        sanfrancisco.loc[i, 'slr'] = 52
    elif sanfrancisco['slr36'].loc[i] == 0:
        sanfrancisco.loc[i, 'slr'] = 48
    elif sanfrancisco['slr24'].loc[i] == 0:
        sanfrancisco.loc[i, 'slr'] = 36
    elif sanfrancisco['slr12'].loc[i] == 0:
        sanfrancisco.loc[i, 'slr'] = 24

In [54]:
sanfrancisco.head()

     VALUE  slr77  slr66  slr52  slr48  slr36  slr24  slr12  slr
0   914191     77   66.0   52.0   48.0   36.0   24.0   12.0   12
1   895343     77   66.0   52.0   48.0   36.0   24.0   12.0   12
2  1042043     77   66.0   52.0   48.0   36.0   24.0   12.0   12
3  1042039     77   66.0   52.0   48.0   36.0   24.0   12.0   12
4  1042035     77   66.0   52.0   48.0   36.0   24.0   12.0   12

In [55]:
sanfrancisco.shape

(1480, 9)

In [56]:
santaclara12['slr12'] = 12
santaclara12 = santaclara12[['VALUE','slr12']]
santaclara24['slr24'] = 24
santaclara24 = santaclara24[['VALUE','slr24']]
santaclara36['slr36'] = 36
santaclara36 = santaclara36[['VALUE','slr36']]
santaclara48['slr48'] = 48
santaclara48 = santaclara48[['VALUE','slr48']]
santaclara52['slr52'] = 52
santaclara52 = santaclara52[['VALUE','slr52']]
santaclara66['slr66'] = 66
santaclara66 = santaclara66[['VALUE','slr66']]
santaclara77['slr77'] = 77
santaclara77 = santaclara77[['VALUE','slr77']]

In [57]:
santaclara = santaclara77.merge(santaclara66, how='left', on='VALUE')
santaclara = santaclara.merge(santaclara52, how='left', on='VALUE')
santaclara = santaclara.merge(santaclara48, how='left', on='VALUE')
santaclara = santaclara.merge(santaclara36, how='left', on='VALUE')
santaclara = santaclara.merge(santaclara24, how='left', on='VALUE')
santaclara = santaclara.merge(santaclara12, how='left', on='VALUE')

In [58]:
santaclara['slr'] = 12
santaclara = santaclara.fillna(0)

In [59]:
for i in santaclara.index:
    if santaclara['slr66'].loc[i] == 0:
        santaclara.loc[i, 'slr'] = 77
    elif santaclara['slr52'].loc[i] == 0:
        santaclara.loc[i, 'slr'] = 66
    elif santaclara['slr48'].loc[i] == 0:
        santaclara.loc[i, 'slr'] = 52
    elif santaclara['slr36'].loc[i] == 0:
        santaclara.loc[i, 'slr'] = 48
    elif santaclara['slr24'].loc[i] == 0:
        santaclara.loc[i, 'slr'] = 36
    elif santaclara['slr12'].loc[i] == 0:
        santaclara.loc[i, 'slr'] = 24

In [60]:
santaclara.head()

     VALUE  slr77  slr66  slr52  slr48  slr36  slr24  slr12  slr
0  1268194     77   66.0   52.0   48.0   36.0   24.0   12.0   12
1  1268223     77   66.0   52.0   48.0   36.0   24.0   12.0   12
2  2048931     77   66.0   52.0   48.0   36.0   24.0   12.0   12
3  1268226     77   66.0   52.0   48.0   36.0   24.0   12.0   12
4  1268091     77   66.0   52.0   48.0   36.0   24.0   12.0   12

In [61]:
sanmateo12['slr12'] = 12
sanmateo12 = sanmateo12[['VALUE','slr12']]
sanmateo24['slr24'] = 24
sanmateo24 = sanmateo24[['VALUE','slr24']]
sanmateo36['slr36'] = 36
sanmateo36 = sanmateo36[['VALUE','slr36']]
sanmateo48['slr48'] = 48
sanmateo48 = sanmateo48[['VALUE','slr48']]
sanmateo52['slr52'] = 52
sanmateo52 = sanmateo52[['VALUE','slr52']]
sanmateo66['slr66'] = 66
sanmateo66 = sanmateo66[['VALUE','slr66']]
sanmateo77['slr77'] = 77
sanmateo77 = sanmateo77[['VALUE','slr77']]

In [62]:
sanmateo = sanmateo77.merge(sanmateo66, how='left', on='VALUE')
sanmateo = sanmateo.merge(sanmateo52, how='left', on='VALUE')
sanmateo = sanmateo.merge(sanmateo48, how='left', on='VALUE')
sanmateo = sanmateo.merge(sanmateo36, how='left', on='VALUE')
sanmateo = sanmateo.merge(sanmateo24, how='left', on='VALUE')
sanmateo = sanmateo.merge(sanmateo12, how='left', on='VALUE')

In [63]:
sanmateo['slr'] = 12
sanmateo = sanmateo.fillna(0)

In [64]:
for i in sanmateo.index:
    if sanmateo['slr66'].loc[i] == 0:
        sanmateo.loc[i, 'slr'] = 77
    elif sanmateo['slr52'].loc[i] == 0:
        sanmateo.loc[i, 'slr'] = 66
    elif sanmateo['slr48'].loc[i] == 0:
        sanmateo.loc[i, 'slr'] = 52
    elif sanmateo['slr36'].loc[i] == 0:
        sanmateo.loc[i, 'slr'] = 48
    elif sanmateo['slr24'].loc[i] == 0:
        sanmateo.loc[i, 'slr'] = 36
    elif sanmateo['slr12'].loc[i] == 0:
        sanmateo.loc[i, 'slr'] = 24

In [65]:
sanmateo.head()

     VALUE  slr77  slr66  slr52  slr48  slr36  slr24  slr12  slr
0  1236492     77   66.0   52.0   48.0   36.0   24.0   12.0   12
1  1050735     77   66.0   52.0   48.0   36.0   24.0   12.0   12
2  1050733     77   66.0   52.0   48.0   36.0   24.0   12.0   12
3  1050734     77   66.0   52.0   48.0   36.0   24.0    0.0   24
4  1056396     77   66.0   52.0   48.0   36.0   24.0   12.0   12

In [66]:
sanmateo.shape

(28234, 9)

In [67]:
solano12['slr12'] = 12
solano12 = solano12[['VALUE','slr12']]
solano24['slr24'] = 24
solano24 = solano24[['VALUE','slr24']]
solano36['slr36'] = 36
solano36 = solano36[['VALUE','slr36']]
solano48['slr48'] = 48
solano48 = solano48[['VALUE','slr48']]
solano52['slr52'] = 52
solano52 = solano52[['VALUE','slr52']]
solano66['slr66'] = 66
solano66 = solano66[['VALUE','slr66']]
solano77['slr77'] = 77
solano77 = solano77[['VALUE','slr77']]

In [68]:
solano = solano77.merge(solano66, how='left', on='VALUE')
solano = solano.merge(solano52, how='left', on='VALUE')
solano = solano.merge(solano48, how='left', on='VALUE')
solano = solano.merge(solano36, how='left', on='VALUE')
solano = solano.merge(solano24, how='left', on='VALUE')
solano = solano.merge(solano12, how='left', on='VALUE')

In [69]:
solano['slr'] = 12
solano = solano.fillna(0)

In [70]:
for i in solano.index:
    if solano['slr66'].loc[i] == 0:
        solano.loc[i, 'slr'] = 77
    elif solano['slr52'].loc[i] == 0:
        solano.loc[i, 'slr'] = 66
    elif solano['slr48'].loc[i] == 0:
        solano.loc[i, 'slr'] = 52
    elif solano['slr36'].loc[i] == 0:
        solano.loc[i, 'slr'] = 48
    elif solano['slr24'].loc[i] == 0:
        solano.loc[i, 'slr'] = 36
    elif solano['slr12'].loc[i] == 0:
        solano.loc[i, 'slr'] = 24

In [71]:
solano.head()

     VALUE  slr77  slr66  slr52  slr48  slr36  slr24  slr12  slr
0  1733934     77    0.0    0.0    0.0    0.0    0.0    0.0   77
1  1733928     77    0.0    0.0    0.0    0.0    0.0    0.0   77
2  1729973     77    0.0    0.0    0.0    0.0    0.0    0.0   77
3  1729972     77    0.0    0.0    0.0    0.0    0.0    0.0   77
4  1732796     77   66.0    0.0    0.0    0.0    0.0    0.0   66

In [72]:
solano.shape

(6413, 9)

In [73]:
sonoma12['slr12'] = 12
sonoma12 = sonoma12[['VALUE','slr12']]
sonoma24['slr24'] = 24
sonoma24 = sonoma24[['VALUE','slr24']]
sonoma36['slr36'] = 36
sonoma36 = sonoma36[['VALUE','slr36']]
sonoma48['slr48'] = 48
sonoma48 = sonoma48[['VALUE','slr48']]
sonoma52['slr52'] = 52
sonoma52 = sonoma52[['VALUE','slr52']]
sonoma66['slr66'] = 66
sonoma66 = sonoma66[['VALUE','slr66']]
sonoma77['slr77'] = 77
sonoma77 = sonoma77[['VALUE','slr77']]

In [74]:
sonoma = sonoma77.merge(sonoma66, how='left', on='VALUE')
sonoma = sonoma.merge(sonoma52, how='left', on='VALUE')
sonoma = sonoma.merge(sonoma48, how='left', on='VALUE')
sonoma = sonoma.merge(sonoma36, how='left', on='VALUE')
sonoma = sonoma.merge(sonoma24, how='left', on='VALUE')
sonoma = sonoma.merge(sonoma12, how='left', on='VALUE')

In [75]:
sonoma['slr'] = 12
sonoma = sonoma.fillna(0)

In [76]:
for i in sonoma.index:
    if sonoma['slr66'].loc[i] == 0:
        sonoma.loc[i, 'slr'] = 77
    elif sonoma['slr52'].loc[i] == 0:
        sonoma.loc[i, 'slr'] = 66
    elif sonoma['slr48'].loc[i] == 0:
        sonoma.loc[i, 'slr'] = 52
    elif sonoma['slr36'].loc[i] == 0:
        sonoma.loc[i, 'slr'] = 48
    elif sonoma['slr24'].loc[i] == 0:
        sonoma.loc[i, 'slr'] = 36
    elif sonoma['slr12'].loc[i] == 0:
        sonoma.loc[i, 'slr'] = 24

In [77]:
sonoma.head()

     VALUE  slr77  slr66  slr52  slr48  slr36  slr24  slr12  slr
0  2004134     77   66.0    0.0    0.0    0.0    0.0    0.0   66
1  2038124     77    0.0    0.0    0.0    0.0    0.0    0.0   77
2  1992520     77   66.0   52.0   48.0   36.0   24.0   12.0   12
3  1992510     77    0.0    0.0    0.0    0.0    0.0    0.0   77
4  1989624     77    0.0    0.0    0.0    0.0    0.0    0.0   77

In [78]:
sonoma.shape

(815, 9)

In [79]:
alameda = alameda.rename(columns={'Value':'parcel_id'})
contracosta = contracosta.rename(columns={'VALUE':'parcel_id'})
marin = marin.rename(columns={'VALUE':'parcel_id'})
napa = napa.rename(columns={'Value':'parcel_id'})
sanfrancisco = sanfrancisco.rename(columns={'VALUE':'parcel_id'})
santaclara = santaclara.rename(columns={'VALUE':'parcel_id'})
sanmateo = sanmateo.rename(columns={'VALUE':'parcel_id'})
solano = solano.rename(columns={'VALUE':'parcel_id'})
sonoma = sonoma.rename(columns={'VALUE':'parcel_id'})

In [80]:
frames = [alameda, contracosta, marin, napa, sanfrancisco, sanmateo, santaclara, solano, sonoma]
parcels_inun = pd.concat(frames)
parcels_inun.head()

   parcel_id  slr77  slr66  slr52  slr48  slr36  slr24  slr12  slr
0          1     77   66.0   52.0   48.0   36.0   24.0   12.0   12
1          2     77   66.0   52.0   48.0   36.0   24.0   12.0   12
2          3     77   66.0   52.0   48.0   36.0   24.0   12.0   12
3          4     77   66.0   52.0    0.0    0.0    0.0    0.0   52
4          5     77   66.0   52.0    0.0    0.0    0.0    0.0   52

In [81]:
parcels_inun.shape

(89129, 9)

In [82]:
parcels_inun = parcels_inun[['parcel_id','slr']]
parcels_inun.head()

   parcel_id  slr
0          1   12
1          2   12
2          3   12
3          4   52
4          5   52

In [95]:
# if RAN again, need to delete index from the csv, and change 'slr' column name to 'inundation'
parcels_inun.to_csv('./slr_parcel_inundation.csv')

In [84]:
alameda.to_csv('./alameda_parcel_inundation.csv')
contracosta.to_csv('./contracosta_parcel_inundation.csv')
marin.to_csv('./marin_parcel_inundation.csv')
napa.to_csv('./napa_parcel_inundation.csv')
sanfrancisco.to_csv('./sanfrancisco_parcel_inundation.csv')
sanmateo.to_csv('./sanmateo_parcel_inundation.csv')
santaclara.to_csv('./santaclara_parcel_inundation.csv')
solano.to_csv('./solano_parcel_inundation.csv')
sonoma.to_csv('./sonoma_parcel_inundation.csv')

In [85]:
parcels_inun.shape

(89129, 2)

In [86]:
# BY COUNTY: count of residential units, job spaces

In [87]:
run_2010 = pd.read_csv('../County TAZs/run7224_parcel_data_2010.csv')

In [88]:
run_2010.head()

,parcel_id,x,y,total_residential_units,total_job_spaces,first_building_type_id,zoned_du,zoned_du_underbuild,zoned_du_underbuild_nodev,hhq1,hhq2,hhq3,hhq4,AGREMPN,MWTEMPN,RETEMPN,FPSEMPN,HEREMPN,OTHEMPN
0,229116,-121.795620,37.655379,0.0,0.0,NaN,6.721103,6,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,244166,-121.713004,37.717277,0.0,0.0,NaN,3.883304,3,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,202378,-122.014199,37.655260,20.0,0.0,16.0,130.445563,110,110,7.0,6.0,3.0,2.0,NaN,NaN,NaN,NaN,NaN,NaN
3,2004420,-122.771868,38.727893,0.0,0.0,4.0,1.318763,1,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,340332,-121.974508,37.546277,0.0,0.0,NaN,14.289466,14,14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [89]:
alameda['county'] = 'alameda'
contracosta['county'] = 'contracosta'
marin['county'] = 'marin'
napa['county'] = 'napa'
sanfrancisco['county'] = 'sanfrancisco'
sanmateo['county'] = 'sanmateo'
santaclara['county'] = 'santaclara'
solano['county'] = 'solano'
sonoma['county'] = 'sonoma'

In [90]:
frames = [alameda, contracosta, marin, napa, sanfrancisco, sanmateo, santaclara, solano, sonoma]
parcel_sum = pd.concat(frames)
print(parcel_sum.head())
print(parcel_sum.shape)

   parcel_id  slr77  slr66  slr52  slr48  slr36  slr24  slr12  slr   county
0          1     77   66.0   52.0   48.0   36.0   24.0   12.0   12  alameda
1          2     77   66.0   52.0   48.0   36.0   24.0   12.0   12  alameda
2          3     77   66.0   52.0   48.0   36.0   24.0   12.0   12  alameda
3          4     77   66.0   52.0    0.0    0.0    0.0    0.0   52  alameda
4          5     77   66.0   52.0    0.0    0.0    0.0    0.0   52  alameda
(89129, 10)

In [91]:
parcel_sum_output = pd.merge(run_2010, parcel_sum, on='parcel_id', how='right')
parcel_sum_output = parcel_sum_output[['county', 'parcel_id', 'slr', 'total_residential_units', 'total_job_spaces']]
parcel_sum_output.head()

         county  parcel_id  slr  total_residential_units  total_job_spaces
0       alameda     145947   52                      0.0               0.0
1       alameda     148948   36                      0.0               0.0
2       alameda     151643   52                      0.0               0.0
3  sanfrancisco     914191   12                    842.0            3253.0
4       alameda     150770   66                      0.0               0.0

In [92]:
parcel_sum_output['parcel_count'] = 1

In [93]:
parcel_output_county = pd.DataFrame({'total_residential_units' : parcel_sum_output.groupby('county')['total_residential_units'].sum(), 'total_job_spaces' : parcel_sum_output.groupby('county')['total_job_spaces'].sum(), 'parcel_count' : parcel_sum_output.groupby('county')['parcel_count'].sum()}).reset_index()
parcel_output_county

         county  parcel_count  total_job_spaces  total_residential_units
0       alameda         27383          151960.0                  38348.0
1   contracosta          2758           18972.0                   3488.0
2         marin         14463           69604.0                  16603.0
3          napa           872            3534.0                    605.0
4  sanfrancisco          1480          151926.0                  14686.0
5      sanmateo         28234          175041.0                  47101.0
6    santaclara          6711           80520.0                  17019.0
7        solano          6413           13161.0                   5909.0
8        sonoma           815            7332.0                    651.0

In [94]:
parcel_output_county.to_csv('./slr_parcel_county.csv')